philpem/STM32_SPL/STM32W108xx_StdPeriph_Driver/inc/stm32w108xx_tim.h
/** @defgroup TIM_Capture_Compare_state 
  * @{
  */
#define TIM_CCx_Enable                      ((uint32_t)0x00000001)
#define TIM_CCx_Disable                     ((uint32_t)0x00000000)
#define IS_TIM_CCX(CCX) (((CCX) == TIM_CCx_Enable) || \
                         ((CCX) == TIM_CCx_Disable))
/**
  * @}
  */ 


/** @defgroup TIM_Input_Capture_Polarity 
  * @{
  */
#define  TIM_ICPolarity_Rising             ((uint32_t)0x00000000)
#define  TIM_ICPolarity_Falling            ((uint32_t)0x00000002)
#define  TIM_ICPolarity_BothEdge           ((uint32_t)0x0000000A)
#define IS_TIM_IC_POLARITY(POLARITY) (((POLARITY) == TIM_ICPolarity_Rising) || \
                                      ((POLARITY) == TIM_ICPolarity_Falling)|| \
                                      ((POLARITY) == TIM_ICPolarity_BothEdge)) 
/**
  * @}
  */ 

/** @defgroup TIM_Input_Capture_Selection 
  * @{
  */
#define TIM_ICSelection_DirectTI           ((uint32_t)0x00000001) /*!< TIM Input 1, 2, 3 or 4 is selected to be 
                                                                   connected to IC1, IC2, IC3 or IC4, respectively */
#define TIM_ICSelection_IndirectTI         ((uint32_t)0x00000002) /*!< TIM Input 1, 2, 3 or 4 is selected to be
                                                                   connected to IC2, IC1, IC4 or IC3, respectively. */
#define TIM_ICSelection_TRGI                ((uint32_t)0x00000003) /*!< TIM Input 1, 2, 3 or 4 is selected to be connected to TRC. */
#define IS_TIM_IC_SELECTION(SELECTION) (((SELECTION) == TIM_ICSelection_DirectTI) || \
                                        ((SELECTION) == TIM_ICSelection_IndirectTI) || \
                                        ((SELECTION) == TIM_ICSelection_TRGI))
/**
  * @}
  */ 

/** @defgroup TIM_Input_Capture_Prescaler 
  * @{
  */
#define TIM_ICPSC_DIV1                     ((uint32_t)0x00000000) /*!< Capture performed each time an edge is detected on the capture input. */
#define TIM_ICPSC_DIV2                     ((uint32_t)0x00000004) /*!< Capture performed once every 2 events. */
#define TIM_ICPSC_DIV4                     ((uint32_t)0x00000008) /*!< Capture performed once every 4 events. */
#define TIM_ICPSC_DIV8                     ((uint32_t)0x0000000C) /*!< Capture performed once every 8 events. */
#define IS_TIM_IC_PRESCALER(PRESCALER) (((PRESCALER) == TIM_ICPSC_DIV1) || \
                                        ((PRESCALER) == TIM_ICPSC_DIV2) || \
                                        ((PRESCALER) == TIM_ICPSC_DIV4) || \
                                        ((PRESCALER) == TIM_ICPSC_DIV8))
/**
  * @}
  */ 

/** @defgroup TIM_interrupt_sources 
  * @{
  */
#define TIM_IT_Update                      ((uint32_t)0x00000001)
#define TIM_IT_CC1                         ((uint32_t)0x00000002)
#define TIM_IT_CC2                         ((uint32_t)0x00000004)
#define TIM_IT_CC3                         ((uint32_t)0x00000008)
#define TIM_IT_CC4                         ((uint32_t)0x00000010)
#define TIM_IT_Trigger                     ((uint32_t)0x00000040)
#define IS_TIM_ITRPT(IT) ((((IT) & (uint32_t)0xFFFFFF00) == 0x00000000) && ((IT) != 0x00000000))

#define IS_TIM_GET_IT(IT) (((IT) == TIM_IT_Update) || \
                           ((IT) == TIM_IT_CC1) || \
                           ((IT) == TIM_IT_CC2) || \
                           ((IT) == TIM_IT_CC3) || \
                           ((IT) == TIM_IT_CC4) || \
                           ((IT) == TIM_IT_Trigger))
/**
  * @}
  */ 

/** @defgroup TIM_External_Trigger_Prescaler 
  * @{
  */
#define TIM_ExtTRGPSC_OFF                  ((uint32_t)0x00000000)
#define TIM_ExtTRGPSC_DIV2                 ((uint32_t)0x00001000)
#define TIM_ExtTRGPSC_DIV4                 ((uint32_t)0x00002000)
#define TIM_ExtTRGPSC_DIV8                 ((uint32_t)0x00003000)
#define IS_TIM_EXT_PRESCALER(PRESCALER) (((PRESCALER) == TIM_ExtTRGPSC_OFF) || \
                                         ((PRESCALER) == TIM_ExtTRGPSC_DIV2) || \
                                         ((PRESCALER) == TIM_ExtTRGPSC_DIV4) || \
                                         ((PRESCALER) == TIM_ExtTRGPSC_DIV8))
/**
  * @}
  */ 

/** @defgroup TIM_Internal_Trigger_Selection 
  * @{
  */
#define TIM_TS_ITR0                        ((uint32_t)0x00000000)
#define TIM_TS_TI1F_ED                     ((uint32_t)0x00000040)
#define TIM_TS_TI1FP1                      ((uint32_t)0x00000050)
#define TIM_TS_TI2FP2                      ((uint32_t)0x00000060)
#define TIM_TS_ETRF                        ((uint32_t)0x00000070)
#define IS_TIM_TRIGGER_SELECTION(SELECTION) (((SELECTION) == TIM_TS_ITR0) || \
                                             ((SELECTION) == TIM_TS_TI1F_ED) || \
                                             ((SELECTION) == TIM_TS_TI1FP1) || \
                                             ((SELECTION) == TIM_TS_TI2FP2) || \
                                             ((SELECTION) == TIM_TS_ETRF))
#define IS_TIM_INTERNAL_TRIGGER_SELECTION(SELECTION) (((SELECTION) == TIM_TS_ITR0))
/**
  * @}
  */ 

/** @defgroup TIM_TIx_External_Clock_Source 
  * @{
  */
#define TIM_TIxExternalCLK1Source_TI1      ((uint32_t)0x00000050)
#define TIM_TIxExternalCLK1Source_TI2      ((uint32_t)0x00000060)
#define TIM_TIxExternalCLK1Source_TI1ED    ((uint32_t)0x00000040)

/**
  * @}
  */ 

/** @defgroup TIM_External_Trigger_Polarity 
  * @{
  */ 
#define TIM_ExtTRGPolarity_Inverted        ((uint32_t)0x00008000)
#define TIM_ExtTRGPolarity_NonInverted     ((uint32_t)0x00000000)
#define IS_TIM_EXT_POLARITY(POLARITY) (((POLARITY) == TIM_ExtTRGPolarity_Inverted) || \
                                       ((POLARITY) == TIM_ExtTRGPolarity_NonInverted))
/**
  * @}
  */

/** @defgroup TIM_Prescaler_Reload_Mode 
  * @{
  */
#define TIM_PSCReloadMode_Update           ((uint32_t)0x00000000)
#define TIM_PSCReloadMode_Immediate        ((uint32_t)0x00000001)
#define IS_TIM_PRESCALER_RELOAD(RELOAD) (((RELOAD) == TIM_PSCReloadMode_Update) || \
                                         ((RELOAD) == TIM_PSCReloadMode_Immediate))
/**
  * @}
  */ 

