philpem/STM32_SPL/STM32W108xx_StdPeriph_Driver/inc/stm32w108xx_tim.h
/** @defgroup TIM_Forced_Action 
  * @{
  */
#define TIM_ForcedAction_Active            ((uint32_t)0x00000050)
#define TIM_ForcedAction_InActive          ((uint32_t)0x00000040)
#define IS_TIM_FORCED_ACTION(ACTION) (((ACTION) == TIM_ForcedAction_Active) || \
                                      ((ACTION) == TIM_ForcedAction_InActive))
/**
  * @}
  */ 

/** @defgroup TIM_Encoder_Mode 
  * @{
  */
#define TIM_EncoderMode_TI1                ((uint32_t)0x00000001)
#define TIM_EncoderMode_TI2                ((uint32_t)0x00000002)
#define TIM_EncoderMode_TI12               ((uint32_t)0x00000003)
#define IS_TIM_ENCODER_MODE(MODE) (((MODE) == TIM_EncoderMode_TI1) || \
                                   ((MODE) == TIM_EncoderMode_TI2) || \
                                   ((MODE) == TIM_EncoderMode_TI12))
/**
  * @}
  */ 

/** @defgroup TIM_Event_Source 
  * @{
  */
#define TIM_EventSource_Update             ((uint32_t)0x00000001)
#define TIM_EventSource_CC1                ((uint32_t)0x00000002)
#define TIM_EventSource_CC2                ((uint32_t)0x00000004)
#define TIM_EventSource_CC3                ((uint32_t)0x00000008)
#define TIM_EventSource_CC4                ((uint32_t)0x00000010)
#define TIM_EventSource_Trigger            ((uint32_t)0x00000040)
#define IS_TIM_EVENT_SOURCE(SOURCE) ((((SOURCE) & (uint32_t)0xFFFFFF00) == 0x00000000) && ((SOURCE) != 0x00000000))

/**
  * @}
  */ 

/** @defgroup TIM_Update_Source 
  * @{
  */
#define TIM_UpdateSource_Global            ((uint32_t)0x00000000) /*!< Source of update is the counter overflow/underflow
                                                                   or the setting of UG bit, or an update generation
                                                                   through the slave mode controller. */
#define TIM_UpdateSource_Regular           ((uint32_t)0x00000001) /*!< Source of update is counter overflow/underflow. */
#define IS_TIM_UPDATE_SOURCE(SOURCE) (((SOURCE) == TIM_UpdateSource_Global) || \
                                      ((SOURCE) == TIM_UpdateSource_Regular))
/**
  * @}
  */ 

/** @defgroup TIM_Output_Compare_Preload_State 
  * @{
  */
#define TIM_OCPreload_Enable               ((uint32_t)0x00000008)
#define TIM_OCPreload_Disable              ((uint32_t)0x00000000)
#define IS_TIM_OCPRELOAD_STATE(STATE) (((STATE) == TIM_OCPreload_Enable) || \
                                       ((STATE) == TIM_OCPreload_Disable))
/**
  * @}
  */ 

/** @defgroup TIM_Output_Compare_Fast_State 
  * @{
  */
#define TIM_OCFast_Enable                  ((uint32_t)0x00000004)
#define TIM_OCFast_Disable                 ((uint32_t)0x00000000)
#define IS_TIM_OCFAST_STATE(STATE) (((STATE) == TIM_OCFast_Enable) || \
                                    ((STATE) == TIM_OCFast_Disable))
/**
  * @}
  */ 

/** @defgroup TIM_Trigger_Output_Source 
  * @{
  */
#define TIM_TRGOSource_Reset               ((uint32_t)0x00000000)
#define TIM_TRGOSource_Enable              ((uint32_t)0x00000010)
#define TIM_TRGOSource_Update              ((uint32_t)0x00000020)
#define TIM_TRGOSource_OC1                 ((uint32_t)0x00000030)
#define TIM_TRGOSource_OC1Ref              ((uint32_t)0x00000040)
#define TIM_TRGOSource_OC2Ref              ((uint32_t)0x00000050)
#define TIM_TRGOSource_OC3Ref              ((uint32_t)0x00000060)
#define TIM_TRGOSource_OC4Ref              ((uint32_t)0x00000070)
#define IS_TIM_TRGO_SOURCE(SOURCE) (((SOURCE) == TIM_TRGOSource_Reset) || \
                                    ((SOURCE) == TIM_TRGOSource_Enable) || \
                                    ((SOURCE) == TIM_TRGOSource_Update) || \
                                    ((SOURCE) == TIM_TRGOSource_OC1) || \
                                    ((SOURCE) == TIM_TRGOSource_OC1Ref) || \
                                    ((SOURCE) == TIM_TRGOSource_OC2Ref) || \
                                    ((SOURCE) == TIM_TRGOSource_OC3Ref) || \
                                    ((SOURCE) == TIM_TRGOSource_OC4Ref))
/**
  * @}
  */ 

/** @defgroup TIM_Slave_Mode 
  * @{
  */
#define TIM_SlaveMode_Reset                ((uint32_t)0x00000004)
#define TIM_SlaveMode_Gated                ((uint32_t)0x00000005)
#define TIM_SlaveMode_Trigger              ((uint32_t)0x00000006)
#define TIM_SlaveMode_External1            ((uint32_t)0x00000007)
#define IS_TIM_SLAVE_MODE(MODE) (((MODE) == TIM_SlaveMode_Reset) || \
                                 ((MODE) == TIM_SlaveMode_Gated) || \
                                 ((MODE) == TIM_SlaveMode_Trigger) || \
                                 ((MODE) == TIM_SlaveMode_External1))
/**
  * @}
  */ 

/** @defgroup TIM_Master_Slave_Mode 
  * @{
  */
#define TIM_MasterSlaveMode_Enable         ((uint32_t)0x00000080)
#define TIM_MasterSlaveMode_Disable        ((uint32_t)0x00000000)
#define IS_TIM_MSM_STATE(STATE) (((STATE) == TIM_MasterSlaveMode_Enable) || \
                                 ((STATE) == TIM_MasterSlaveMode_Disable))
/**
  * @}
  */ 

/** @defgroup TIM_Input_Capture_Filer_Value 
  * @{
  */
#define IS_TIM_IC_FILTER(ICFILTER) ((ICFILTER) <= 0xF) 
/**
  * @}
  */ 

/** @defgroup TIM_External_Trigger_Filter 
  * @{
  */
#define IS_TIM_EXT_FILTER(EXTFILTER) ((EXTFILTER) <= 0xF)
/**
  * @}
  */

/** @defgroup TIM_OCReferenceClear 
  * @{
  */
#define TIM_OCReferenceClear_ETRF          ((uint32_t)0x00000008)
#define TIM_OCReferenceClear_OCREFCLR      ((uint32_t)0x00000000)
#define TIM_OCREFERENCECECLEAR_SOURCE(SOURCE) (((SOURCE) == TIM_OCReferenceClear_ETRF) || \
                                              ((SOURCE) == TIM_OCReferenceClear_OCREFCLR)) 
/**
  * @}
  */

/** @defgroup TIM_Remap 
  * @{
  */
#define TIM_REMAPC1         ((uint32_t)0x00000010)
#define TIM_REMAPC2         ((uint32_t)0x00000020)
#define TIM_REMAPC3         ((uint32_t)0x00000040)
#define TIM_REMAPC4         ((uint32_t)0x00000080)
#define IS_TIM_REMAP(TIM_Remap) (((TIM_Remap) == TIM_REMAPC1) || \
                                 ((TIM_Remap) == TIM_REMAPC2) || \
                                 ((TIM_Remap) == TIM_REMAPC3) || \
                                 ((TIM_Remap) == TIM_REMAPC4))  
/**
  * @}
  */

